__load-testing__/artillery-load.yml
config:
  target: http://localhost:5858
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/pack"
          - get:
              url: "/pack/categorized"
          - get:
              url: "/short"
          - get:
              url: "/short/categorized"
          - get:
              url: "/category/packsAndShorts"